src/src/DataProcessors/OrdersClosing.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>OrdersClosing</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>SalesOrders</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Completed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PurchaseOrders</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Completed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ProductionOrders</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Completed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>WorkOrders</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Completed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/src/DataProcessors/OrdersClosing/Forms/Form/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DocumentInitiator = Undefined;
	Parameters.Property("DocumentInitiator", DocumentInitiator);
	
	DataProcessorObject = FormAttributeToValue("Object");
	DataProcessorObject.FillOrders(Parameters);
	ValueToFormAttribute(DataProcessorObject, "Object");
	FormManagment();
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure MarkAllExecute(Command)
	
	Tab = StrReplace(Items.Pages.CurrentPage.Name, "Page", "");
	
	For Each Row In Object[Tab] Do
		Row.Mark = True;	
	EndDo;
	
EndProcedure

&AtClient
Procedure ClearAllExecute(Command)
	
	Tab = StrReplace(Items.Pages.CurrentPage.Name, "Page", "");
	
	For Each Row In Object[Tab] Do
		Row.Mark = False;	
	EndDo;
	
EndProcedure

&AtClient
Procedure Complete(Command)
	CompleteAtServer();
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Procedure FormManagment()
	
	Items.PageSalesOrders.Visible = Object.SalesOrders.Count();
	Items.PagePurchaseOrders.Visible = Object.PurchaseOrders.Count();
	Items.PageProductionOrders.Visible = Object.ProductionOrders.Count();
	Items.PageWorkOrders.Visible = Object.WorkOrders.Count();

	ThereAreOrders = Object.SalesOrders.Count() 
		Or Object.PurchaseOrders.Count()
		Or Object.ProductionOrders.Count()
		OR Object.WorkOrders.Count();
		
	Items.DecorationAllOrdersClosed.Visible = Not ThereAreOrders;
	Items.CloseOrders.Visible = ThereAreOrders;
	
EndProcedure

&AtServer
Procedure CompleteAtServer()
	
	DataProcessorObject = FormAttributeToValue("Object");
	DataProcessorObject.CloseOrders();
	ValueToFormAttribute(DataProcessorObject, "Object");
	
EndProcedure

#EndRegion
